* The ones I could not parse

dmg@phosphorus:~/w/courses/2010/seng265s/unix$ cat  restaurantsVictoria.txt | cut -d ';' -f 2 | sed "s/'/\\\\'/g" | xargs -n1 -I@ sh saveRestInfo.sh '@'
saveRestInfo.sh: 3: cannot create CROWN PALACE/CHICKEN ON THE RUN.txt: Directory nonexistent
saveRestInfo.sh: 3: cannot create EUGENE'S WAREHOUSE/COMMISSARY.txt: Directory nonexistent
saveRestInfo.sh: 3: cannot create SHARE ORGANICS/FOOD ROOTS.txt: Directory nonexistent
saveRestInfo.sh: 3: cannot create THRIFTY FOODS #6, MEAT/SEAFOOD.txt: Directory nonexistent
saveRestInfo.sh: 3: cannot create TRAFALGAR/PRO PATRIA BRANCH #292.txt: Directory nonexistent
saveRestInfo.sh: 3: cannot create TRAFALGAR/PRO PATRIA BRANCH #292, KITCHEN.txt: Directory nonexistent


#+begin_src R :results table  :exports both :cache yes 
r<-read.csv('restaurants20140716.csv',sep=';') 
#s<-r[r$type=='Food (Licensed Premises)',c(1,3,4,6)]
s<-r[r$type=='Food (Take Out)',c(1,3,4,6)]
#s<-r[r$type=='Food (Mobile)',c(1,3,4,6)]
s
#+end_src

#+RESULTS[743528416c6ffe40bd02e8fc68f79353b4e5ef0b]:
| 7-ELEVEN                                     | 904 Yates Street                     |  6010677 | All year long                       |
| 7-ELEVEN                                     | 1327 Douglas Street                  |  6012853 | All year long                       |
| 7-ELEVEN                                     | 910 Government Street                | 64004857 | All year long                       |
| 7-ELEVEN #34579                              | 813 Douglas Street                   | 64007719 | All year long                       |
| 7-ELEVEN #34998                              | 811 Bay Street                       | 64007875 | All year long                       |
| A & W                                        | FC7 - 3147 Douglas Street            | 64006239 | All year long                       |
| A & W RESTAURANT                             | 208 - 1644 Hillside Avenue           | 64006036 | All year long                       |
| A & W RESTAURANT                             | 432 - 1150 Douglas Street            | 64006042 | All year long                       |
| ALI BABA PIZZA                               | 775 Fort Street                      | 64005081 | All year long                       |
| ALI BABA PIZZA MAYFAIR                       | FC-6 3147 Douglas Street             | 64008426 | All year long                       |
| ALPINE FLORIST & FOOD MARKET, TAKE OUT       | 821 Fort Street                      | 64008771 | All year long                       |
| AMBROSIA                                     | 638 Fisgard Street                   | 64009147 | All year long                       |
| AUBERGINE FOODS                              | 1308 Gladstone Avenue                | 64007509 | All year long                       |
| AWESOME COFFEE                               | 717 Douglas Street                   | 64009202 | All year long                       |
| AYO EAT                                      | 140 - 560 Johnson Street             | 64007431 | All year long                       |
| BEACON HILL LITTLE LEAGUE CONCESSION         | 1594 Fairfield Road                  | 64000122 | Apr May Jun Jul                     |
| BENTO NOUVEAU                                | 670 Fort Street                      | 64005172 | All year long                       |
| BIG ORANGE                                   | 312 - 3147 Douglas Street            | 64008689 | All year long                       |
| BIG ORANGE                                   | 410 - 1150 Douglas Street            | 64008911 | All year long                       |
| BLAIR MART                                   | 924 Pandora Avenue                   | 64002855 | All year long                       |
| BOND BOND'S BAKERY                           | 1010 Blanshard Street                | 64005393 | All year long                       |
| BOOSTER JUICE                                | 102 - 240 Cook Street                | 64007405 | All year long                       |
| BOULANGERIE FOL EPI                          | 101 - 398 Harbour Road               | 64006770 | All year long                       |
| BOWS & ARROWS COFFEE ROASTERS                | 483 Garbally Road                    | 64008221 | All year long                       |
| CASA CONVENIENCE STORE - TAKE OUT            | 102 1483 Douglas Street              | 64008966 | All year long                       |
| CLEOPATRA HOOKAH LOUNGE                      | 101 - 732 Broughton Street           | 64008281 | All year long                       |
| COSMOS 2 FOR 1 PIZZA & PASTA                 | 1557 Pandora Avenue                  | 64001531 | All year long                       |
| COTTAGE BAKERY & CAFE                        | E & F - 1267 Fairfield Road          | 64008903 | All year long                       |
| CROWN PALACE/CHICKEN ON THE RUN              | 405 Craigflower Road                 |  6011941 | All year long                       |
| CURRY POINT                                  | FCI - 3147 Douglas Street            | 64009944 | All year long                       |
| DAVIDS TEA, #46                              | 96 - 1644 Hillside Avenue            | 64007874 | All year long                       |
| DAVIDS TEA, #55                              | 606 Johnson Street                   | 64008040 | All year long                       |
| DOMINO'S PIZZA                               | 102 1420 Quadra Street               | 64006333 | All year long                       |
| EDO JAPAN                                    | 431 - 1150 Douglas Street            | 64007382 | All year long                       |
| EDO JAPAN                                    | #21 Unit FC12 - 1644 Hillside Avenue | 64008978 | All year long                       |
| FAIRFIELD MARKET                             | 1275 Oscar Street                    | 64008835 | All year long                       |
| FAIRMONT EMPRESS - BENGAL KITCHEN            | 721 Government Street                | 64008739 | All year long                       |
| FAIRWAY MARKET - SUSHI VILLAGE FOODS         | 2635 Quadra Street                   | 64007774 | All year long                       |
| FISH STORE, TAKE OUT                         | 310 St. Lawrence Close               | 64007083 | All year long                       |
| FORT CAFE                                    | 1310 Douglas Street                  | 64009083 | All year long                       |
| FRY'S BAKERY                                 | 416 Craigflower Road                 | 64008485 | All year long                       |
| GLEN'S FABULOUS SANDWICHES                   | 414 - 1150 Douglas Street            |  6011268 | All year long                       |
| GOOD EARTH CAFE                              | 1952 Bay Street                      | 64008088 | All year long                       |
| GRILLIGANS BBQ                               | 310 St. Lawrence Street              | 64005804 | Feb Mar Apr May Jun Aug Sep Oct Nov |
| GROCERY PLUS, TAKE OUT                       | 1126 Quadra Street                   | 64009287 | All year long                       |
| HECKLERS BAR & GRILL (KITCHEN)               | 123 Gorge Road East                  | 64006362 | All year long                       |
| HERITAGE STARBUCKS COFFEE                    | 470 Belleville Street                | 64009250 | All year long                       |
| HOOK FINE FOODS                              | 805 Fort Street                      | 64008832 | All year long                       |
| HOT HOUSE PIZZA                              | 110 - 180 Wilson Street              | 64004204 | All year long                       |
| ISLAND MEAT & SEAFOOD                        | 307 Cook Street                      | 64007348 | All year long                       |
| JACKSON'S ICE CREAM FLOAT                    | 310 St. Lawrence Street              | 64005363 | Mar Apr May Jun Jul Aug Sep Oct     |
| JOE'S SEAFOOD BAR                            | 101 - 1208 Wharf Street              | 64007423 | May Jun Jul Aug Sep Oct             |
| JUGO JUICE                                   | 101 - 1150 Douglas Street            | 64008593 | All year long                       |
| KENTUCKY FRIED CHICKEN                       | FC 8 - 3147 Douglas Street           | 64001886 | All year long                       |
| KERNELS POPCORN                              | 115A - 1644 Hillside Avenue          | 64009200 | All year long                       |
| KFC #1861                                    | 3140 Douglas Street                  | 64007999 | All year long                       |
| KORYO KOREAN BARBEQUE                        | 413 - 1150 Douglas Street            | 64007895 | All year long                       |
| LA COCINA DE MAMA OLI                        | 6 - Kiosk 5 1701 Douglas Street      | 64008972 | All year long                       |
| LA FOGATA LATINA RESTAURANTS                 | 749 View Street                      | 64009425 | All year long                       |
| LE PETIT DAKAR                               | 711 Douglas Street                   | 64008101 | All year long                       |
| LITTLE CAESARS                               | 1627 Hillside Avenue                 | 64008104 | All year long                       |
| LOGANS PUB, KITCHEN                          | 1821 Cook Street                     | 64004534 | All year long                       |
| LOY SING MEAT MARKET & DELI                  | 554 Fisgard Street                   |  6010689 | All year long                       |
| MAC'S CONVENIENCE STORE                      | 324 Cook Street                      | 64000526 | All year long                       |
| MAC'S #11213                                 | 1300 Douglas Street                  | 64008527 | All year long                       |
| MACCHIATO                                    | 1002 Broad Street                    | 64005501 | All year long                       |
| MALEA COFFEE                                 | 769 Fort Street                      | 64008578 | All year long                       |
| MANCHU WOK                                   | FC9 - 3147 Douglas Street            | 64009212 | All year long                       |
| MARBLE SLAB CREAMERY                         | 200C - 1150 Douglas Street           | 64008766 | All year long                       |
| MARKET ON YATES, DELI                        | 903 Yates Street                     |  6012772 | All year long                       |
| MCDONALD PARK MEN'S FASTBALL LEAGUE          | Niagara & Oswego Street              |  6012878 | May Jun Jul Aug                     |
| MESSOB ETHIOPIAN CUISINE                     | 8 - 1109 McKenzie Street             | 64001200 | All year long                       |
| MINATO EXPRESS SUSHI                         | E - 1109 McKenzie Street             | 64008390 | All year long                       |
| MOTHER NATURE'S MARKET & DELI                | 103 - 240 Cook Street                | 64008475 | All year long                       |
| MOUNT ROYAL BAGEL FACTORY                    | 6 - 1115 North Park Street           |  6011420 | All year long                       |
| MRS. VANELLI'S                               | 433 - 1150 Douglas Street            | 64005427 | All year long                       |
| NATIONAL GEOGRAPHIC THEATER                  | 675 Belleville Street                |  6012530 | All year long                       |
| NATIONAL LITTLE LEAGUE CLUBHOUSE             | 1280 Hillside Avenue                 | 64003883 | Mar Apr May Jun Jul                 |
| NEW YORK FRIES                               | FC209 - 1670 Hillside Avenue         |  6012003 | All year long                       |
| NEW YORK FRIES                               | FC 5 3147 Douglas Street             | 64001907 | All year long                       |
| NEW YORK FRIES                               | 411 - 1150 Douglas Street            | 64002578 | All year long                       |
| NIAGARA GROCERY                              | 579 Niagara Street                   | 64007293 | All year long                       |
| NPC TRUST UNIT 32                            | 850 Burdett Avenue                   | 64000354 | All year long                       |
| ODEON THEATRE                                | 780 Yates Street                     | 64003154 | All year long                       |
| OH GELATO                                    | 1013 Government Street               | 64003547 | All year long                       |
| OPA SOUVLAKI OF GREECE                       | FC204 - 1644 Hillside Avenue         | 64008292 | All year long                       |
| OPA! SOUVLAKI                                | 435 - 1150 Douglas Street            | 64006613 | All year long                       |
| OPA! SOUVLAKI                                | F. C. 10 3147 Douglas Street         | 64007621 | All year long                       |
| ORANGE JULIUS                                | FC 12 - 3147 Douglas Street          | 64006580 | All year long                       |
| ORANGE JULIUS DQ                             | 134 - 1644 Hillside Avenue           | 64000278 | All year long                       |
| ORCHARD ON VIEW                              | 205A - 1150 Douglas Street           | 64003228 | All year long                       |
| ORIGIN GLUTEN-FREE BAKERY                    | 1525 Pandora Avenue                  | 64007398 | All year long                       |
| OUR PLACE SOCIETY, NUTRITION BAR             | 919 Pandora Avenue                   | 64006483 | All year long                       |
| PALAGIO                                      | 165 - 2950 Douglas Street            | 64006903 | All year long                       |
| PALAGIO                                      | 2637 Quadra Street                   | 64005912 | All year long                       |
| PALATE                                       | 851 Johnson Street                   | 64008908 | All year long                       |
| PATISSERIE DANIEL                            | 1729 Cook Street                     |  6011769 | All year long                       |
| PHO BOI RESTAURANT                           | FC11 - 3147 Douglas Street           | 64008886 | All year long                       |
| PIZZA AL FORNO                               | 456G Gorge Road East                 | 64009932 | All year long                       |
| PIZZA ALLNITE                                | 106 - 2714 Quadra Street             | 64007378 | All year long                       |
| PIZZA HUT                                    | 182 - 911 Yates Street               | 64005578 | All year long                       |
| PUERTO VALLARTA AMIGOS                       | Dock C-39 - 12 Erie Street           | 64008190 | All year long                       |
| PURDY'S CHOCOLATES                           | 369 3147 Douglas Street              |  6010145 | All year long                       |
| PURDY'S CHOCOLATES                           | 3184 Shelbourne Street               |  6010929 | All year long                       |
| PURDY'S CHOCOLATES                           | 102 - 1150 Douglas Street            |  6011208 | All year long                       |
| QOOLA FROZEN YOGURT BAR                      | CRU 98 - 1644 Hillside Avenue        | 64008800 | All year long                       |
| QUONLEY'S MARKET, ICE CREAM                  | 1628 Government Street               |  6012832 | All year long                       |
| RAVENSTONE FARM ARTISAN MEATS                | 6 1701 Douglas Street                | 64009242 | All year long                       |
| RED FISH BLUE FISH                           | 1006 Wharf Street                    | 64006050 | All year long                       |
| RICA SALSA                                   | 1109 McKenzie Street                 | 64007951 | All year long                       |
| ROAST CARVERY                                | 6 - 1701 Douglas Street              | 64008867 | All year long                       |
| ROCK N' ROLLS                                | C1 - 1 Dallas Road                   | 64009886 | All year long                       |
| ROCKY MOUNTAIN CHOCOLATE FACTORY             | 909 Government Street                | 64008708 | All year long                       |
| ROYAL ATHLETIC PARK CONCESSION 1 & 2         | 1014 Caledonia Avenue                |  6010582 | Apr May Jun Jul Aug Sep             |
| ROYAL ATHLETIC PARK CONCESSION 4, 5 & 6      | 1014 Caledonia Avenue                |  6011045 | All year long                       |
| SALT SPRING ISLAND CHEESE                    | 14 - 1701 Douglas Street             | 64009107 | All year long                       |
| SAN REMO MARKET DELI                         | 1002 Hillside Avenue                 | 64004998 | All year long                       |
| SAVE-ON-FOODS - 921 - DELI                   | 1950 Foul Bay Road                   | 64009553 | All year long                       |
| SAVE-ON-FOODS - 921 - TIM HORTONS            | 1950 Foul Bay Road                   | 64009544 | All year long                       |
| SAVE ON FOODS MEMORIAL CENTRE - CONCESSION 1 | 1925 Blanshard Street                | 64004331 | All year long                       |
| SAVE ON FOODS MEMORIAL CENTRE - CONCESSION 2 | 1925 Blanshard Street                | 64004332 | All year long                       |
| SAVE ON FOODS MEMORIAL CENTRE - CONCESSION 3 | 1925 Blanshard Street                | 64004333 | All year long                       |
| SAVE ON FOODS #973, DELI                     | 100 - 172 Wilson Street              |  6012679 | All year long                       |
| SHANGHAI NOODLE                              | 2224 Quadra Street                   | 64003804 | All year long                       |
| SHATTERBOX COFFEE BAR                        | 950 Yates Street                     | 64008581 | All year long                       |
| SIZZLING WOK                                 | # 434 - 1150 Douglas Street          | 64007395 | All year long                       |
| SOLSTICE CAFE LIMITED                        | 529 Pandora Avenue                   | 64000276 | All year long                       |
| SOUPED UP FOODS                              | 450 Beta Street                      | 64007047 | All year long                       |
| STARBUCKS COFFEE CO. #4223                   | 97 - 1644 Hillside Avenue            |  6012112 | All year long                       |
| STIR IT UP                                   | G1 - 1284 Gladstone Avenue           | 64006421 | All year long                       |
| SUB STOP SHOP                                | 680 Gorge Road East                  | 64008052 | All year long                       |
| SUBWAY                                       | FC4 - 3147 Douglas Street            | 64001872 | All year long                       |
| SUBWAY                                       | 4 - 1952 Bay Street                  | 64007827 | All year long                       |
| SUBWAY                                       | FC11 - 21 - 1644 Hillside Avenue     | 64009027 | All year long                       |
| SUMERIA CAFFE BAR TO GO                      | 1329 Cook Street                     | 64007191 | All year long                       |
| SUPERIOR PIZZA                               | 1B - 425 Simcoe Street               | 64008064 | All year long                       |
| TABOO GOURMET CHEESECAKE                     | 400 - 2950 Douglas Street            | 64007984 | All year long                       |
| TACO TIME                                    | FC3 3147 Douglas Street              | 64005208 | All year long                       |
| TACO TIME                                    | 412 - 1150 Douglas Street            | 64005211 | All year long                       |
| TACO TIME                                    | 207 - 1644 Hillside Avenue           | 64005210 | All year long                       |
| TEA L C  CAFE                                | 2410 Lee Avenue                      | 64000997 | All year long                       |
| TEAVANA #836                                 | 125 3147 Douglas Street              | 64008792 | All year long                       |
| THE APPLE BOX                                | 2 - 1725 Cook Street                 | 64009520 | All year long                       |
| THE BAKED POTATO                             | 69 - 560 Johnson Street              | 64009268 | All year long                       |
| THE FRENCH OVEN                              | 6 - 1701 Douglas Street              | 64009099 | All year long                       |
| THE LITTLE CHEESE SHOP                       | 1034 Fort Street                     | 64008977 | All year long                       |
| THRIFTY FOODS #17, DELI                      | 1580 Hillside Avenue                 | 64006170 | All year long                       |
| THRIFTY FOODS #17, SUSHI BAR                 | 1580 Hillside Avenue                 | 64007708 | All year long                       |
| THRIFTY FOODS #1, DELI                       | 1590 Fairfield Road                  | 64006174 | All year long                       |
| THRIFTY FOODS #6, DELI                       | 475 Simcoe Street                    | 64006201 | All year long                       |
| THRIFTY FOODS, SUSHI BAR                     | 475 Simcoe Street                    | 64007709 | All year long                       |
| THRIFTY FOODS, SUSHI BAR                     | 1590 Fairfield Road                  | 64007837 | All year long                       |
| TIM HORTONS                                  | 280 - 3147 Douglas Street            | 64006735 | All year long                       |
| TIM HORTONS                                  | FF201 - 1644 Hillside Avenue         | 64003307 | All year long                       |
| TIM HORTONS                                  | 1700 Hillside Avenue                 | 64009181 | All year long                       |
| TODAY'S LUNCH CO.                            | 361 Burnside Road East               | 64000457 | All year long                       |
| UMI SUSHI EXPRESS                            | FC2 - 3147 Douglas Street            | 64007534 | All year long                       |
| UMI SUSHI EXPRESS - BAY CENTRE               | 2 - 1150 Douglas Street              | 64007017 | All year long                       |
| UNION PACIFIC COFFEE COMPANY                 | 537 Herald Street                    | 64005151 | All year long                       |
| VEGAS CONVENIENCE STORE                      | 113 - 864 Pembroke Street            | 64009260 | All year long                       |
| VICTORIA BBQ HOUSE & BAKERY                  | 1714 Government Street               | 64000218 | All year long                       |
| VICTORIA ICE CREAM & FUDGE FACTORY           | 905 Government Street                | 64005907 | All year long                       |
| VIHA - ROYAL JUBILEE TIM'S #63244            | 1952 Bay Street                      | 64003795 | All year long                       |
| VIHA ROYAL JUBILEE, 2.MATO #63252            | PCC Room #160A - 1952 Bay Street     | 64008505 | All year long                       |
| VOODOO COFFEE                                | 2950 Douglas Street                  | 64007985 | All year long                       |
| WANNAWAFEL                                   | 102 560 Johnson Street               | 64007345 | All year long                       |
| WELLBURN'S, DELI                             | 1058 Pandora Avenue                  |  6011416 | All year long                       |
| WILLIE'S BAKERY & CAFE                       | 537 Johnson Street                   | 64002413 | All year long                       |
| WRAP N ROLL PIZZA                            | 1885 Fort Street                     | 64009426 | All year long                       |
| YOKA'S COFFEE & HONEY                        | 5 - 1046 Mason Street                | 64007700 | All year long                       |



